#include <stdio.h>		//stdio.h 라이브러리를 추가한다. 
						//전처리기, 전처리지시문 프로그램이 실행될 때 가장 먼저 실행 ex) #include, #define
// 주석 : 컴퓨터가 코드로 인식하지 않음.(변수의 위나 옆에 붙이면 변수의 꼬리표가 됨)
/*
[자료형] 저장공간
*정수
	char		= 1byte		[아스키코드 표 참조] -128	~	+127
	short		= 2byte		-32768	~	+32767
	int			= 4byte		(2byte또는 4byte이다)
	long		= 4byte		-2147483648	~	+2147483647
	long long	= 8byte
	_int64		= 8byte int

*실수
	float	= 4byte
	double	= 8byte

 1bit -> 0과 1이 들어갈수 있는 네모 1칸
 8bit -> 1byte
1024byte -> 1KB (2의10승 1024)


[디버그]
	최초의 컴퓨터 속에 벌레가 들어가 오류가 났을 때 벌레를 빼내는 행위였다.

[연산자]
	[+]	더하기
	[-]	빼기
	[*]	곱하기
	[/]	나누기
	[%] 나머지
	
	[=] 대입연산자

	[.] 닷
	[,] 콤마
	[:] 콜론
	[;] 세미콜론

[문자와 문자열의 표현]
	[' '] 작은따옴표 문자
	[" "] 큰따옴표 문자열

[단항 연산]
	[*] 에스터리스크	포인터
	[&] 엠퍼센트		주소값반환

	()	소괄호
	{}	중괄호
	[]	대괄호

[논리 연산자]
	[&]	AND
	[|]	OR
	[^] XOR
	[!] NOT

*/


int main(void)	// int =자료형(함수의 y값의 형태지정) main = 함수명 (void) = 함수의 x값
{

	return 0;	// 함수의 y값
}
 
 
 